// 1. Напишіть функцію isEmpty, яка робить  перевірку об'єкта на порожнечу.

// const data = { a: 1, };
// const data2 = {  };

// console.log(isEmpty(data)); // false
// console.log(isEmpty(data2)); // true

//-------------------------

// // 2. Напишіть функцію isEqual, яка  порівнює два об'єкти.


// -------------------------

// 3. Створіть функцію topSalaryWorker (salaries), яка повертає ім'я найбільш оплачуванного працівника.
// Якщо об'єкт salaries порожній, потрібно повернути null.
// Використовуйте Object.entries, щоб перебрати пари ключ/значення.

// const salaries = {
//     "John": 172300,
//     "Pete": 300,
//     "Mary": 200,
//     "Joe": 400
// };



//--------------------------

// 4. Реалізувати функцію createNewUser для створення об'єкта "користувач".

// 1) Написати функцію createNewUser(), яка буде створювати та повертати об'єкт newUser.
// 2) При виклику функція повинна запитати  ім'я та прізвище.
// 3) Використовуючи дані, введені користувачем, створити об'єкт newUser з властивостями firstName та lastName.
// 4) Додати в об'єкт newUser метод getLogin(), який повертатиме першу літеру імені користувача, з'єднану з прізвищем користувача, все в нижньому регістрі
// (наприклад, Ivan Kravchenko → ikravchenko).
// 5) Створити користувача за допомогою функції createNewUser(). Викликати функцію користувача getLogin(). Вивести у консоль результат виконання функції.
